app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fsdfsdf"], ["body", "jlkkb"], ["user_id", 9], ["created_at", "2021-03-23 10:04:13.748618"], ["updated_at", "2021-03-23 10:04:13.748618"]]